Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Boyfriend Makeover.tmx
Source language: ko_kr
Languages: en_us

source: 진짜 멋있어!!!
en_us: ...really cool!!!

source: 자 그럼 어디 한 번...
en_us: okay, now. let’s see...

source: 그만큼 열심히 했다는 거지~
en_us: it’s proof of how hard he worked out.

source: 우리 가족들 구식이라 뉴튜브 이런 거 잘 몰라…
en_us: my family is old-fashioned, so they don’t know what newtube is...

source: 펴, 평생 관리?
en_us: f-for the rest of my life?

source: 참고로 저는 백시원보다 백배천배 나은 남자 만날 거니 크게 걱정 안해주셔도 됩니다.
en_us: FYI, I’m going to meet a guy who’s a million times better than Siwon, so please don’t worry too much about me.

source: 민호 마음 속의 만식이 호감도 상승!!!
en_us: minho warmed up to mansik super fast!!!

source: 내가 용이 된다!
en_us: I’ll be a dragon soon!

source: 알렉스님이랑 시아언니{j}콜라보 프로젝트였군요!!!
en_us: so this was a collab with alex and sia!!!{j}

source: 이번 겨울방학에 큐브몬스터 극장판 개봉하는 건 잊지 않았겠지?
en_us: haven’t forgotten that the cube monster movie is coming out during winter vacation, right?

source: 빨리 뭐라도 찍어서 올려야 하는데...
en_us: I have to post something soon...

source: 아저씨…
en_us: mr. yoon...

source: 무려 짜장라면 이라구, 먹음직스러워~
en_us: they’re instant black bean noodles! don’t they look delicious?

source: 그, 그게 아니고....!
en_us: i-it isn’t what you think...

source: 사귀자고 한 건 무슨 말이야...?
en_us: ...have to do with being your boyfriend?

source: 보고 싶어...
en_us: I miss you,

source: 헤헤...
en_us: hehe...

source: 진심입니다!!
en_us: I’m serious, miss!!!

source: 저기...
en_us: guys...

source: 난 이만 가볼게~
en_us: I’m going to go home now.

source: 에이씨…!!
en_us: ugh!

source: 청년들아 기회가 왔다
en_us: Youth, It’s Your Chance!

source: 추우욱...
en_us: DROOP

source: 그 찐따랑 안 찍어!
en_us: no way am I filming with that loser!

source: 씻으러 갈게...
en_us: gonna wash up...

source: 흐읍
en_us: DUN

source: 생각한 거 없는데…
en_us: no, I didn’t...

source: 왜, 너 어릴 때 내가 피아노 학원도 데려다주고 그랬잖아!
en_us: I used to walk you to your piano classes when we were kids!

source: 뭘 시켜도 좋으니까 난 괜찮아,
en_us: you can tell me to do anything.

source: 방금 구워 따끈따끈한 문어빵이…!!
en_us: warm, freshly baked octopus bread!

source: 마음 약하게 갖지 말자,
en_us: I can’t get weak.

source: 낄낄낄
en_us: CACKLE

source: 친구와 함께라면 <실연의 아픔>따위 아무것도 아니야!!!
en_us: as long as you have a good friend, heartbreak is nothing!!!

source: 그 사이에서 난 병풍이 된 것만 같았어.
en_us: it felt like I was just one of the trees there...

source: 더 자세하게 말해 달라구!
en_us: tell me in more detail!

source: 꺄아아
en_us: KYAAA

source: 네버랜드 V-LOG
en_us: Amusement Park Vlog

source: 후-
en_us: HUFF

source: 도대체 뭐하는 만화인지 궁금해서…
en_us: so I’m just curious about what that anime is about...

source: 자아, 그래서 어느 그룹이지?
en_us: so tell me! which group is it?

source: 찰칵
en_us: SNAP

source: 2조각째…
en_us: second slice...

source: 흘금...
en_us: GLANCE

source: 살이 빠진다면 한 달 쯤이야…
en_us: if I can lose weight, a month is nothing...

source: 저건 진심이다...!! '리얼'이라고...!!!!
en_us: he’s serious!!! this is real!!!!

source: bye 편의점
en_us: bye CONVENIENCE

source: 천호점
en_us: Cheonho Branch

source: 아리가또...
en_us: arigato (thank you)...

source: 쟤가 걔야!
en_us: that’s him!

source: 으햐~
en_us: phew!!!

source: 고작 크리스마스 선물 주고 받은 걸로
en_us: if you’re going to call this a date just because of some gifts,

source: 우히히
en_us: HEHEHE

source: 어머, 너무 잘 어울린다!{j}학생~
en_us: oh my! that looks so good on you, dear!{j}

source: 재밌었지!?
en_us: fun, right?!

source: 성장기이기도 하고...
en_us: besides, he’s still growing...

source: 와
en_us: wow!

source: 그럼 먹방 뉴튜버는 어때?
en_us: then what about a mukbang?

source: 그러냐...
en_us: I see...

source: 이제 나, 날 믿어주는 거야?
en_us: y-you have faith in me now?

source: 아아, 그게~
en_us: ooh! well...

source: 드디어 일주일간의 극한 다이어트 식단이 끝났고,
en_us: ...the week of extreme dieting finally ended.

source: 여자친구는 무슨…
en_us: a girlfriend? nah...

source: 친구?
en_us: a friend?

source: 크리스마스니까…
en_us: because it’s christmas...

source: 빨리 나와!
en_us: follow me!

source: 그런데…
en_us: but...

source: 어우 시끄러~
en_us: ugh, they’re so loud.

source: 그럼 어디가지…
en_us: where should we go then?

source: 그게 뭔데...?
en_us: what does that mean?

source: 아!
en_us: oh!

source: 차려준다는 점심이 라면이었어...?
en_us: you made me... instant noodles?

source: 꼭!!!
en_us: for sure!!!

source: 척
en_us: DUN

source: 효주는 원래 크리스마스마다 가족들이랑 보내고!!
en_us: hyoju always spends christmas with her family!!!

source: 갈수록 잘 어울리는 듯!!
en_us: You both keep looking better and better!!

source: 지금 딱 중요한 부분인데..!!
en_us: she’s about to say something important!!!

source: 며칠 후
en_us: a few days later

source: 봐, 남들은 다 굶으면서 잘 빼는데…
en_us: look, everyone else is losing weight fast by starving themselves...

source: 실망스럽다 윤시아..
en_us: what a disappointment, sia...

source: 그리고 난 김민호 코찔찔이 시절부터 봐와서, 절~대 설렐 일 없으니 그런 줄 알아.
en_us: besides, minho and I go way back, from when he was a snot-face. there’s no way I’d get nervous around him.

source: 음식은 평소에 먹던 양의 절반으로 줄여 먹게 되었다.
en_us: ...portioned to half of what he used to eat.

source: 오후 4:12
en_us: 4:12 PM

source: 계속해서 진행되는 애니송 퍼레이드…
en_us: ...they continued to sing anime songs nonstop.

source: 댓글 1.2천
en_us: 1,200 comments

source: 천사 떡볶이
en_us: Angel’s Tteokbokki

source: 대박...
en_us: awesome!

source: 제 새로운 남자친구를 공개합니다!!
en_us: please give a warm welcome to my new boyfriend!!!

source: 거친 어둠이 나를 덮치려 해도 괜찮아~
en_us: even if darkness tries to overcome me, I’ll be fine~

source: 이제 남은 기간이 40일 정도밖에 되지 않기 때문에…
en_us: now, they only had about 40 days remaining.

source: 반응이 왜 저래?
en_us: why is he like that?

source: 건강한 모습으로 내년에 보자~
en_us: let’s all come back healthy next year!

source: 아나타도 하토니 나코나코니~
en_us: anatado hatoni nako nakoni~

source: 아무래도 나...
en_us: I suppose...

source: 티켓 1+1
en_us: BOGO Tickets

source: 자존심 상함
en_us: doesn’t want to admit it

source: 짜잔~
en_us: TA DA

source: 꽝이면 어떡하냐고!!!
en_us: what if he’s a dud?!!!

source: 최만식?
en_us: mansik choi?

source: 아무리 김민호라도 잘 어울리겠지?
en_us: ...so it should look okay on minho too.

source: 오랜만에 브이로그로 인사드리네요
en_us: it’s been a while since I’ve posted a vlog, right?

source: 너희들!
en_us: you!

source: 마, 맞아...
en_us: y-yeah...

source: 헐...
en_us: whoa...

source: 까먹은 건가?
en_us: did she forget?

source: 황당...
en_us: SPEECHLESS

source: 좋아하는 사람 앞에서만은...!!
en_us: not in front of the girl I like!

source: 부, 붕어빵…?
en_us: b-bungeo-ppang?

source: 윽
en_us: UGH

source: 강태범(32) 시아 삼촌
en_us: taebeom kang, 32 years old sia’s uncle

source: 얼굴은 내 취향이 아니지만…
en_us: although his face isn’t exactly my type...

source: 내가 시아쨩이랑 데이트를 한다고…?
en_us: I’m going... on a date with sia-chan?

source: 시아 네 집은 언제 와도 포근하고 좋은 것 같아…
en_us: sia, your place is always so warm and cozy...

source: 이제 어때?
en_us: so what do you think now?

source: 오성환 선생님!!!
en_us: master oh!!!

source: 12정류장 전
en_us: 12 stops away

source: 테스트 컷이 이렇게 좋다니…!
en_us: his test shots are fantastic!

source: 잠깐, 윤시아가 지금 당장 나오라고 했다고…?
en_us: wait. she told u to come out... right now?

source: 벌떡!
en_us: STAND

source: 테, 테스트...?
en_us: a t-test?

source: 뉴튜버 윤시아님 맞으세요?
en_us: are you the newtuber, sia yoon?

source: 뭐야, 뭐 지나갔어?
en_us: what was that? did something just pass by?

source: 내가 잘못한 거 있어?
en_us: you didn’t do anything wrong!

source: 그, 그게...!
en_us: th-that’s-!

source: 내 골드버튼을 위하여...!!
en_us: gold button, here I come!!!

source: 매일 매일 배달음식이나 라면만 먹다가 직접 해먹으니,
en_us: now that I make my own food instead of ordering takeout or eating instant noodles,

source: 웃어봐, 시원아~
en_us: smile, siwon!

source: 내가 왜 여기에 있는 거야?
en_us: why am I here?

source: 드륵
en_us: SLIDE

source: 시아 남동생 시우
en_us: sia’s younger brother, siu

source: 죄책감 같은 게 생기더라구…
en_us: ...and guilty at the same time.

source: 저, 저길 혼자 들어가야 한다고...!?
en_us: I-I have to... go in there alone?!

source: 시아꺼
en_us: Sia’s

source: 나 좋다며!!!
en_us: he said he liked me!!!

source: 야, 야아!!
en_us: h-hey!!!

source: 중학생 시아
en_us: sia in middle school

source: 뭔가 익숙한데...
en_us: ...does he look familiar?

source: 네, 넵!!
en_us: y-yes, ma’am!!!

source: 얼른 훈남되자 김민호
en_us: Minho will be a hunk soon!

source: 왜 이렇게 마음이…
en_us: ...but why do I feel like this?

source: 어?
en_us: oh?

source: 우리들?
en_us: us?

source: 힝구
en_us: SNIFFLE

source: 이런 곳에서 자면 피부에 안 좋은데...
en_us: sleeping here can’t be good for his skin...

source: 불쑥!
en_us: HMPH!

source: 개선해야 할 점들이 한 눈에 보여.
en_us: I can see where he can improve all at once.

source: 죽을 준비는 되어 있겠지...
en_us: you’re ready to die now, right?

source: 갑자기 무릎을 꿇으면 어떡해!!!
en_us: you can’t suddenly go down on your knees like that!!!

source: 으...으으...
en_us: uh... ergh...

source: 우당탕탕
en_us: STOMP STOMP

source: 시아쨩도 나 못 알아봤으면서!!!
en_us: sia-chan, you didn’t recognize me either!!!

source: 내가 여태 한 건 운동이 아니었구나!!
en_us: so this is what a real workout is like!!!

source: 시아쨩이 잠깐 나와보라고 해서 ㅠㅠ 고멘네, 성환쿤…
en_us: sia-chan wants me to come out :((( gomenne, seonghwan-kun...

source: 하하...
en_us: haha...

source: 야, 괜찮냐?
en_us: hey, you okay?

source: 난 벌써 지겨워 죽겠는데…
en_us: I’m already so sick of it...

source: 그동안 민호는…
en_us: and during that time, minho...

source: 우와...
en_us: wow...

source: 훗
en_us: HEHE

source: 흑...
en_us: sniffle...

source: ASSISTANT 김진완
en_us: ASSISTANT Jinwan Kim

source: 에, 에에에엣!?!?!?
en_us: wh-whaaaaaaat?!!!

source: 펭 펭도리 1빠
en_us: P penguinlover first!

source: 두고 보라고!!
en_us: just wait and see!!!

source: 오늘은 스팜 라면이다!
en_us: I’m gonna make ham noodles today!

source: 좋겠다, 시아야~ 너 사랑받고 있구나?
en_us: lucky sia! you’re really loved, aren’t you?

source: 구취합니다;;
en_us: Unsubbing. Bye.

source: 다음화에 계속!
en_us: To be continued...

source: 내놔~ 내놓으라구!!
en_us: give it! give it back!!

source: 글쎄, 너희들은 평소에 뭐 하고 놀아?
en_us: I’m not sure. what do you two normally do while you’re out?

source: 나도 변하고 싶어...
en_us: I want to change...

source: 난 매일 꿈을 꿔~ 이 천국에서~
en_us: I dream every day~ in heaven~

source: 솔직히 포기하고 싶었던 순간들도 많았는데,
en_us: to be honest, there were many times I wanted to quit...

source: 시아남친 헬짱만들기
en_us: Sia’s Boyfriend: Body Makeover

source: 또래들보다 키도 작고 몸이 약했던 11살의 나는...
en_us: at 11 years old, I was smaller and weaker than most kids my age...

source: 저, 저기 그런데 만식아...
en_us: b-but... mansik...

source: 같이 가자!
en_us: wait for me!

source: 커플 채널에서 이름을 바꾼 윤시아의 채널은
en_us: sia’s channel, which had previously been a couple’s channel...

source: 미도
en_us: MIDO B

source: 일종의 실험 영상?
en_us: kind of like a challenge.

source: 아니이...
en_us: I mean...

source: 365 바로
en_us: 365 SERVICE

source: 네가 뭔데!!
en_us: who are you to tell me what to do?!

source: 요즘 고등학생 뷰티 뉴튜버 중에 제일 핫한 애라구!
en_us: yeah, of all beauty content by high schoolers, my friend’s is the hottest!

source: 아하하, 귀엽다 김민호~
en_us: ahaha, he’s so cute!

source: 근손실 오니까 ^^
en_us: you’ll lose muscle. HEHE

source: 아~
en_us: oh...

source: 민호 여동생이면...
en_us: your younger sister is...

source: 그러고보니 곧 50만 구독자인데...
en_us: oh yeah! we’re going to hit 500k subscribers soon.

source: 우르르
en_us: CROWD

source: 훅 훅
en_us: HUFF HUFF

source: 엥
en_us: EH

source: 배고파!
en_us: I’m hungry!

source: 성 성지훈
en_us: J Jihoon Sung

source: 이번 주 일욜에 가자.
en_us: let’s go this sunday.

source: 꿀꺽...
en_us: gulp...

source: 으, 으으...
en_us: eh, ugh...

source: 언니 메이크업은 재능없는듯...
en_us: sia doesn’t have the talent for makeup...

source: 윤시아 쟤 힘만 세면 다냐고!
en_us: sia’s strong, but that’s all she has!

source: 휴우...
en_us: phew...

source: 결국 몸살이 나 운동을 쉬게 되었다고 한다...
en_us: ...had to take a break because his entire body was too sore.

source: 오빠가...?
en_us: this early?

source: 쟤네들 좀 어떻게 해 봐!!
en_us: do something about them!

source: 하…
en_us: SIGH

source: 제법 잘 생겨보인다!!!
en_us: ...look pretty handsome!!!

source: 나코짱...
en_us: nako-chan...

source: 이렇게 좁고 구린데.
en_us: this place is so tiny and old.

source: 잘 부탁한다.
en_us: nice to meet you too.

source: 꼬옥
en_us: SQUEEZE

source: 그게 누구냐면...!
en_us: that friend is...

source: 나 적게 먹거든, 이정도면 엄청 먹은 거야.
en_us: I don’t eat much. actually, I ate more than usual today.

source: 씨익
en_us: GRIN

source: 뭐지…
en_us: what?

source: 그 땐 방심했지 모얌
en_us: I was caught off-guard at the store.

source: 나 이상해져 버린걸까..?
en_us: what if something’s wrong with me?

source: 후다닥
en_us: DASH

source: 안 먹었어!!!
en_us: I-I didn’t eat it!!!

source: 니들 뭐해!!
en_us: why are you just standing around?!

source: 굳이?
en_us: ...but why should I?

source: 너도 존잘남이 되는 거야!
en_us: ...you have to become a superstud!

source: 마, 말했잖아...
en_us: I-I told you....

source: 아파트
en_us: Apartment

source: 설마 옆동네 포X 몬스터랑 헷갈린 건 아니겠지!?
en_us: you’re not confusing it with that pocket monster series, are you?!

source: 앞으로도 이렇게만 하자!!
en_us: let’s just keep going like this!

source: 누군가 깨워주지 않아도 스스로 기상한 후,
en_us: ...sia wakes up without an alarm...

source: 시아는 건들지 마!!!
en_us: leave sia alone!!!

source: 후하...
en_us: GASP

source: 뭔가 헤어질 것 같았어...
en_us: I kinda knew it was coming...

source: 360도 달라진 네 모습~
en_us: you’ve changed and done a three-sixty~

source: 뉴튜브 찍자!
en_us: NewTube! Please???

source: 그...{j}그래?{j}왜?
en_us: real...ly? why?{j}{j}

source: 찰싹!
en_us: SLAP

source: 미안해요, 형.
en_us: I’m sorry.

source: 너무해...
en_us: so mean...

source: 학폭위 신고 해야 하는 거 아냐?
en_us: sia, shouldn’t we report them for school violence?

source: 갑자기 그런 질문을 하면...!!!
en_us: the questions are so sudden!!!

source: 랑 뭔데여??
en_us: R what??

source: 잉스타 스타 윤시아 완성!
en_us: ...the instargram star sia yoon comes about!

source: 이세계 장래희망은 마법사 입니다만? ※ 아닐수도?
en_us: My Dream? To Be a Mage! ※ Or not.

source: 못 해!!!
en_us: ...do any more!!!

source: ㅋㅋ
en_us: LOL

source: 흐음...
en_us: hmm...

source: 쇼-네은요 (소년이여)
en_us: yonu- tairedo (young child)

source: 6년 만에 재회한...
en_us: we reunited after six long years...

source: 시아쨩은 애초에 운동 신경이 좋잖아…!
en_us: sia-chan! you’re physically talented to begin with!

source: 설마 이거…
en_us: this can’t be...

source: 식이요법이랑 근력 운동을 함께하면 분명 네 몸도 더 건강하고 탄력있게 가꿀 수 있을 거야!
en_us: with a good meal plan and some strength training, you can have a healthier, toned body soon!

source: 에, 에엣...?
en_us: h-huh?

source: 오늘 어땠어?
en_us: how was it today?

source: 제가 시아님을 사랑하는 마음은 진심이라구요...!!
en_us: ...but my love for you is genuine, ms. sia!!

source: 누가봐도 잘생긴 외모에
en_us: no one can deny how hot he is.

source: 지금 설마…
en_us: no way...

source: 어색...
en_us: AWKWARD

source: 내 문제점들을 고쳐 준다고...?
en_us: change... my habits?

source: 바람이라도 폈어?
en_us: did he cheat on you?

source: 좋아, 목표 체중은 68kg다!!!
en_us: okay! your goal is 150 pounds!!!

source: 야, 너 뭐야!
en_us: hey, what happened?!

source: 이대로가면 체지방량도 표준까지 내려오고, 체중도 정상 체중이 될 거야.
en_us: at this rate, his body fat will come down to standard levels and he’ll be at a normal weight soon.

source: 그러게 살 빠져서 못 알아볼뻔ㅋㅋㅋ
en_us: you’re right! he lost weight, so I didn’t recognize him, hahaha.

source: 다른 사진?
en_us: other pictures?

source: 그러고보니 겨울방학도 이제 얼마 안 남았다.
en_us: come to think of it, winter vacation is almost over,

source: 찐라면
en_us: Spicy Noodles

source: 대림 부동산 2F
en_us: Daerim Realty 2F

source: 쩌저적...
en_us: CRAAACK

source: 난 민호가 원하는 걸 해준 적이 없잖아.
en_us: I’ve never done anything minho wanted.

source: 그럼 커플도 아닌데 크리스마스에 둘이 왜 만났어~!?
en_us: then why would you two meet up on christmas?

source: 젠장!!
en_us: dammit!!

source: GIANT 불고기 버거 BURGER
en_us: GIANT BULGOGI BURGER

source: 허우적
en_us: FLOUNDER

source: 무슨 가사인지 하나도 못 알아듣겠어!!
en_us: ...and I can’t even understand the lyrics!!!

source: 같이 사진 찍어야지!!
en_us: I want a picture with him!!!

source: 진심으로 하는 말이야.
en_us: I’m serious.

source: 그런데 꽃분이 언니가 우리 집엔 왜...
en_us: but daisy... why are you here?

source: 넌 혼자가 아니야!!
en_us: you’re not alone!!!

source: 안돼애애애애!!!!
en_us: nooooo!!!!

source: 방학동안 연락 자주 하고!!
en_us: oh, and call me often during vacation!!!

source: 뭐, 뭐?
en_us: wh-what?

source: 왜, 너 얼빠라며.
en_us: you said you’re a sucker for good-looking faces.

source: 잠깐 어디 좀 갈래?
en_us: let’s go talk somewhere else.

source: 뭐라고?
en_us: what?

source: 아웃사이트
en_us: OutSite

source: 만식이가 말한 곳으로 일단 오긴 왔는데...
en_us: I’m here because mansik told me to come...

source: 우움..
en_us: mmm...

source: 와주셨군요!
en_us: you came!

source: 다행이야...
en_us: I was doing okay?

source: 왜, 또 김민호한테 까였어?
en_us: why? did minho reject you?

source: 나는...
en_us: I...

source: 살이 잘 빠지는 거 보니~
en_us: seeing that he’s losing weight again.

source: 시, 시아야...
en_us: s-sia...

source: 야, 야아~!!
en_us: h-hey!

source: 시아쨩이 날 위해 이렇게 열심히 노력하는데...
en_us: sia-chan is trying so hard for my sake...

source: 나 라방 오랜만이라 넘 떨려...!!
en_us: it’s been so long since I’ve been live! I’m so nervous!!!

source: 남녀가 사귀다가 헤어질 수도 있지!
en_us: it’s not weird for a couple to break up!

source: 자, 그럼 하나~ 둘~
en_us: then, ready? one~ two~

source: 갑자기 분위기도 살벌해졌고...
en_us: things turned for the worst really fast...

source: 물어나보자, 왜 그런 짓을 한 거야?
en_us: so, tell me. why the hell did you do that?

source: 정신과의원
en_us: PSYCHIATRY

source: 됐어, 기죽지마, 윤시아!
en_us: forget it. don’t back down, sia yoon!

source: 내 마음엔 하트가 버블버블~
en_us: hearts bubble up in my heart~

source: 민호네 개인 사정 때문에...
en_us: minho had no choice...

source: 오성화(17)
en_us: seonghwan oh, 17 years old

source: 진짜야?
en_us: are you sure?

source: 벌써 3개월이나 됐는데!
en_us: it’s already been three months!

source: 대박~!!
en_us: whoa!

source: 그런데 이거… 뭔가 묘하게
en_us: but... for some reason...

source: 추천 3445개
en_us: 3445 likes

source: 오늘만 쉬자!
en_us: I’ll take a break only for today!

source: 뭐, 뭐야!
en_us: wh-what the-?!

source: 으아아!!
en_us: aaaah!!!

source: 이름은 내가 알던 이름이 아니었어.
en_us: but her name wasn’t what I knew her as.

source: (추측이지만...)
en_us: (I think...)

source: 다 들린다~ 들려~
en_us: I can hear everything, you know...

source: 사람마다 체질이 다른데...
en_us: every person’s body is different.

source: 우와…많이 바귀긴 했네.
en_us: wow... he does look very different.

source: 나의 평범했던 일상으로 돌아갈 수 없을 것 같고,
en_us: ...I probably won’t be allowed to enjoy my normal routine.

source: 무, 무슨 조건이길래 장소까지...
en_us: wh-what condition? why is it a secret?

source: 너도 만족할만한 다이어트 법을 새로 만들어 줄테니까
en_us: I’ll come up with a weight loss routine that you’ll like.

source: 진짜 대박이다!!!
en_us: this is so awesome!!!

source: 언제까지 앉아 있을래?
en_us: can you get up?

source: 글쎄...
en_us: well...

source: 마음은 놓이네…
en_us: that makes me feel better...

source: 애니노래 극혐ㅋㅋㅋㅋ
en_us: I hate these anime songs.

source: 무난한 조회수와,
en_us: it got a lot of views...

source: 민호킁!!
en_us: minho-kun!!!

source: 후
en_us: HUUU

source: 오늘은 김민호가 좋아하는 것들을 해보기로 한 날이니까…
en_us: since I decided to do what minho likes today...

source: 으, 으아아!!
en_us: a-argh!!!

source: 절대 살이 찔 수가 없는 식단이었는데...
en_us: but there’s no way he could’ve gained weight with that meal plan...

source: 완전 복덩이라니까…
en_us: he’s a total gem!

source: 저, 저게 뭐래...!
en_us: wh-what the heck is she saying?!

source: 아아… 그러고보니 시아쨩 남동생 있었지.
en_us: oh... right. sia-chan, you have a younger brother.

source: 시아님...!!!
en_us: ms. siaaa!!!

source: 평소였으면 씻지도 않고 잤을 텐데...
en_us: normally, he would’ve gone to bed without even washing...

source: 아까부터 나만 부르려니까 민망한데?
en_us: it’s kind of embarrassing when I’m the only one doing it.

source: 화르륵
en_us: GRRR

source: 꽃분이는 에바잖아!
en_us: “daisy” feels really old!

source: 걔가 불편하려나…
en_us: seonghwan-kun? will he be uncomfortable?

source: 어떤 사람인데 그래~!!
en_us: who even is it?!

source: 한 개로 나눠 먹기로 함
en_us: agreed to split one burger in half

source: 어 (묵)
en_us: WE

source: 야, 체중계 고장난 거 아니야?
en_us: wait, maybe the scale’s broken.

source: 다 됐고 내 50만 구독자 어떡할 거냐고!!
en_us: ugh, whatever! give back my 500k subscribers!!!

source: 별빛내과의원 3층
en_us: Starlight Medical Clinic 3F

source: 프로젝트 때문에 어쩔 수 없으니까...
en_us: ...but couldn’t do anything, since this was for the project.

source: 시, 시아쨩이 날 위해 열심히 옷을 찾아주고 있잖아…?
en_us: s-sia-chan is working so hard to find me clothes...

source: 쓸데없는 걱정 말고 온바디부터 재고 와!
en_us: don’t worry about that and just go get your body measurements first!

source: 좋은 결과 기대해도 될 듯!!!
en_us: I’m sure he’ll see great results!!!

source: 아, 아빠!
en_us: ugh, dad!

source: 시아와 7년지기
en_us: sia’s best friend of seven years

source: 여동생은 학원에 보충수업 갔고, 아빠는 해외에 출장 가셔서 한동안 집에 안 계셨어.
en_us: my younger sister went to study at her academy, and my dad’s away on a long business trip overseas.

source: 새우통면 BIG 찐라면
en_us: Shrimp Noodles BIG Spicy Noodles

source: 큐브 몬스터 극장판이 곧 상영종료라서 성환쿤이랑 같이 보러 가기로 했어!
en_us: the cube monster movie will stop showing in theaters soon, so seonghwan-kun and I agreed to go see it together!

source: 나 못 움직이겠어...
en_us: I can’t move...

source: 그, 그게...
en_us: w-well...

source: 아아, 이거?
en_us: oh, this?

source: 드, 드디어...
en_us: f-finally...

source: 시아짱이 갑자기 왜 날...?
en_us: why is sia-chan suddenly... asking for me?

source: 시아한테 물어볼까...?
en_us: should I ask her?

source: 음정 점프 멜로디 뮤직 마이크 에코
en_us: Pitch Jump Melody Music Mic Echo

source: <노래방>은 말이지, 어떻게 말하면 오타쿠들의 필수 코스라고 할 수 있지.
en_us: you see, karaoke is pretty much a must-do as an anime geek.

source: 뭐어!?
en_us: what?!

source: ㅋㅋㅋㅋ등신~
en_us: gahaha! moron!

source: 두리번
en_us: GLANCE

source: 얘 좀 봐!
en_us: look at this!

source: 최만식은 민호의 현재 상태를 체크한 후,
en_us: like that, mansik took notes on minho’s current condition...

source: 시키신 대로 했습니다!!
en_us: I followed all of your instructions!!

source: 피부 하얀 거 봐...
en_us: look at how smooth her skin is...

source: 갑자기...!?
en_us: ...suddenly?!

source: 시아짱이 말한 가장 쉬운 방법...
en_us: the really easy way that sia-chan mentioned...

source: 골… 골…
en_us: STAGGER STAGGER

source: 정체기…!?
en_us: ...a plateau, can it?!

source: 조회수 105만회 1일전
en_us: 1.05M views 1 day ago

source: 저 오타쿠놈들 오늘은 또 무슨 컨셉 잡은 거야!
en_us: what are those weird otakus trying to do now?

source: 저, 저 녀석은!!!
en_us: i-it’s him!!!

source: 숭덩 숭덩
en_us: SCOOP SCOOP

source: 뛰, 뛰겠습니다!!!
en_us: I-I’ll run!!!

source: 자, 우리 앞으로 잘 해보자.
en_us: so let’s turn you into a stud, minho.

source: 정말 이거 다 먹어도 되는 거지!?
en_us: I can eat all this?!

source: 응!!
en_us: yup!!!

source: 예를 들어 평소 하던 운동에서 근력운동의 비율과 강도를 높이거나,
en_us: for example, you can increase the amount and intensity of weight training.

source: 지방분석
en_us: Muscle/Fat Analysis

source: 영화를 보러 온 나 자신….
en_us: being out here to watch a movie...

source: 덕분에 나는 유명인사가 되었다.
en_us: and now, I am a famous figure.

source: 아니!
en_us: geez!

source: 내가 뭐라고 먹을 거 다 챙겨먹으면서 살 빼냔 말이야.
en_us: who am I to attempt losing weight while eating every meal?

source: 에?
en_us: huh?

source: 차단!
en_us: block!

source: 그런데… 넌 언제부터 만화를 좋아하게 된 거야?
en_us: hey... when did you start liking comics and cartoons?

source: 아쿠마노 요오니- (악마처럼)
en_us: wikedu demone- (wicked demon)

source: 민호킁 네가 현실여자를 좋아하게 됐다고!?
en_us: minho-kun! you like a girl in the real world now?!

source: 20개만 더 하자~
en_us: let’s just do 20 more!

source: [Vlog/고등커플] 할로윈 맞아 교복입고 네버랜드!
en_us: [Vlog/High School Couple] Halloween at an Amusement Park, in School Uniforms!

source: 내 시그니처-와도 같은 오덕말투가 없어지고 있다니!!
en_us: my geek-talk is like my identity! but it was disappearing?!

source: 첫번째 룩!
en_us: first outfit!

source: 그 '듀' 계집애 잘난 척 하는 거 더 이상 볼 수 없으니까!
en_us: and I can’t take anymore of that dooh girl’s conceitedness anymore!

source: 걔는 말야~
en_us: you see...

source: 시~원~아~!!
en_us: siiiwoooon!!!

source: 프로젝트가 성공적으로 끝나게 되면 널 내 남친으로 인정해줄게.
en_us: if the project is successful, I’ll accept you as my boyfriend.

source: 인기있는 남자가 되는 법!
en_us: here’s how you can be a popular man!

source: 너도 윤시아 봐?
en_us: do you watch sia yoon’s channel?

source: 나 요즘 얘 구독한다?
en_us: I started following this channel recently.

source: Ww
en_us: hehe

source: 뭐...?
en_us: what?

source: 잘 따라오는 중이야.
en_us: he’s following along really well.

source: 오늘부로 민호는 다른 학교로 전학을 가게 됐어.
en_us: kids, your friend minho transferred to another school today.

source: 흐음~
en_us: HMM

source: 강보배 무리들...!!!
en_us: ...are part of bobae’s crew!!!

source: 나코쨩이라구우!!
en_us: she’s nako-chan!!!

source: 하루 쇼핑몰
en_us: HARU MALL

source: 민호는 무려,
en_us: minho...

source: 미안하쟈나…
en_us: I feel bad...

source: 내놔, 안 빌려줘!!
en_us: give it back! you can’t use it!

source: 언니도 알겠지만 우리 오빠 어렸을 땐 괜찮게 생겼었거든요.
en_us: I’m sure you know, daisy, but minho was actually pretty good-looking as a kid.

source: 차근 차근 하나씩 해나가기 시작했다.
en_us: minho began changing his routine little by little.

source: 도, 도, 도, 도대체 뭐가 문제였던 거지!?!!
en_us: wh-wh-wh-what was the problem?!

source: 우리 민호 빨리 킹카된 거 보고싶다~~~
en_us: I can’t wait to see Minho as a stud!!!

source: 바카!
en_us: baka!
